# CannotEditEditingElements Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..CannotEditEditingElements Property
BuiltInFailures..::..EditingFailures Class See Also
---
Can't obtain permission to edit the element: The Central Model is inaccessible and another user is editing the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotEditEditingElements { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotEditEditingElements As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotEditEditingElements {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace